; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	spectrograph2 - mode
	thermograph0 - mode
	spectrograph3 - mode
	infrared1 - mode
	GroundStation4 - direction
	Star3 - direction
	GroundStation5 - direction
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Phenomenon6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star3)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star2)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(supports instrument2 spectrograph3)
	(calibration_target instrument2 Star0)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star1)
	(supports instrument4 infrared1)
	(calibration_target instrument4 Star2)
	(calibration_target instrument4 Star1)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
)
(:goal (and
	(pointing satellite1 GroundStation5)
	(pointing satellite2 Star0)
	(have_image Phenomenon6 spectrograph2)
	(have_image Star7 spectrograph2)
	(have_image Star8 thermograph0)
	(have_image Phenomenon9 spectrograph3)
	(have_image Planet10 infrared1)
	(have_image Star11 infrared1)
	(have_image Star12 infrared1)
))

)

; plan
1. (turn_to satellite2 star0 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star0)
   goals met: 1 of 9
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 1 of 9
3. (calibrate satellite2 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 1 of 9
4. (turn_to satellite2 phenomenon9 star0)
   deleted: (pointing satellite2 star0)
   added: (pointing satellite2 phenomenon9)
   goals met: 0 of 9
5. (turn_to satellite1 groundstation5 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation5)
   goals met: 1 of 9
6. (turn_to satellite0 star0 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star0)
   goals met: 1 of 9
7. (take_image satellite2 phenomenon9 instrument2 spectrograph3)
   added: (have_image phenomenon9 spectrograph3)
   goals met: 2 of 9
8. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 9
9. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 2 of 9
10. (turn_to satellite0 phenomenon6 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon6)
   goals met: 2 of 9
11. (take_image satellite0 phenomenon6 instrument0 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 3 of 9
12. (turn_to satellite0 star7 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star7)
   goals met: 3 of 9
13. (take_image satellite0 star7 instrument0 spectrograph2)
   added: (have_image star7 spectrograph2)
   goals met: 4 of 9
14. (turn_to satellite2 planet10 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet10)
   goals met: 4 of 9
15. (take_image satellite2 planet10 instrument2 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 5 of 9
16. (turn_to satellite2 star11 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star11)
   goals met: 5 of 9
17. (take_image satellite2 star11 instrument2 infrared1)
   added: (have_image star11 infrared1)
   goals met: 6 of 9
18. (turn_to satellite2 star12 star11)
   deleted: (pointing satellite2 star11)
   added: (pointing satellite2 star12)
   goals met: 6 of 9
19. (take_image satellite2 star12 instrument2 infrared1)
   added: (have_image star12 infrared1)
   goals met: 7 of 9
20. (turn_to satellite2 star8 star12)
   deleted: (pointing satellite2 star12)
   added: (pointing satellite2 star8)
   goals met: 7 of 9
21. (take_image satellite2 star8 instrument2 thermograph0)
   added: (have_image star8 thermograph0)
   goals met: 8 of 9
22. (turn_to satellite2 star0 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 star0)
   goals met: 9 of 9
